БухЭксп/Enums/ВидОплатыНаТерминале.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОплатыНаТерминале</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатиQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦифровойРубль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/ВидОплатыНаТерминале/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает код вида оплаты на терминале
// 
// 
// Возвращаемое значение:
//  Соответствие
//                  
Функция КодВидаОплатыНаТерминале() Экспорт
	
	Результат = Новый Соответствие(); 
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта")  , 0);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR")  , 1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"), 2);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ЦифровойРубль"), 3);
	Возврат Результат;
	
КонецФункции

// Возвращает вид оплаты на терминале по коду.
// 
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ВидОплатыНаТерминалеПоКоду() Экспорт
	
	Результат = Новый Соответствие();   
	Результат.Вставить(0, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.Карта"));
	Результат.Вставить(1, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.СБПQR"));
	Результат.Вставить(2, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ПлатиQR"));
	Результат.Вставить(3, ПредопределенноеЗначение("Перечисление.ВидОплатыНаТерминале.ЦифровойРубль"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#КонецЕсли
